In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
y = [1,2,3,4,5]

x = ['a','b','c','d','e']
z = {1:'a',2:'c',3:'c',4:'d',5:'e'}

In [4]:
pd.Series(y)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
A = [1,32,3,4]
B = [5,7,9,8]
C = [6,5,2,80]
D = [6,46,1,7]

In [6]:
df = pd.DataFrame([A,B,C,D],['a','b','c','d'],['w','x','y','z'])

In [7]:
df

   w   x  y   z
a  1  32  3   4
b  5   7  9   8
c  6   5  2  80
d  6  46  1   7

In [8]:
df['S'] = df['x'] + df['y']

In [9]:
df

   w   x  y   z   S
a  1  32  3   4  35
b  5   7  9   8  16
c  6   5  2  80   7
d  6  46  1   7  47

In [10]:
df.drop('S',axis=1)

   w   x  y   z
a  1  32  3   4
b  5   7  9   8
c  6   5  2  80
d  6  46  1   7

In [11]:
df

   w   x  y   z   S
a  1  32  3   4  35
b  5   7  9   8  16
c  6   5  2  80   7
d  6  46  1   7  47

In [12]:
df.drop('S',axis=1,inplace=True)

In [13]:
df

   w   x  y   z
a  1  32  3   4
b  5   7  9   8
c  6   5  2  80
d  6  46  1   7

In [14]:
df.loc['a']

w     1
x    32
y     3
z     4
Name: a, dtype: int64

In [15]:
df.iloc[2]

w     6
x     5
y     2
z    80
Name: c, dtype: int64

In [16]:
df.loc['a','z']

4

In [17]:
df > 3

       w     x      y     z
a  False  True  False  True
b   True  True   True  True
c   True  True  False  True
d   True  True  False  True

In [19]:
df[df['y'] > 3]

   w  x  y  z
b  5  7  9  8